In [1]:
import pandas as pd
import numpy as np
from scipy import stats as stats

import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [7]:
data = pd.read_csv('./data.csv', sep = ';').dropna().set_index(['Grupo', 'i'])

In [8]:
data.head()

               m    d1    d2    d3    d4
Grupo i
2.0   1.0  1.171  20.0  19.5  18.7  19.2
      2.0  1.042  17.0  16.7  16.5  16.4
      3.0  1.161  19.3  19.3  19.0  19.4
      4.0  1.255  21.7  22.2  22.7  21.5
      5.0  1.180  19.0  20.2  19.0  19.5

In [9]:
data.describe()

               m         d1         d2         d3         d4
count  30.000000  30.000000  30.000000  30.000000  30.000000
mean    1.256567  21.650000  21.752667  21.803000  21.650667
std     0.083035   1.733321   1.654453   1.899543   1.794147
min     1.042000  17.000000  16.700000  16.500000  16.400000
25%     1.210500  20.465000  20.925000  20.962500  20.525000
50%     1.254500  21.700000  21.800000  22.200000  21.755000
75%     1.313750  23.000000  22.970000  22.872500  22.822500
max     1.394000  24.460000  24.500000  24.590000  24.640000